<script lang="ts" setup>
const config = useRuntimeConfig()
useHead({
  script: [
    {
      src: config.public.typoTextSrc,
      tagPosition: 'bodyClose'
    }
  ]
})
</script>

<template>
  <typo-text
    font-size="15px"
    text-align="left"
    column-count="1"
    column-width="520px"
    line-height="24px"
  >
    <h1 heading-size="lg" heading-align="center">Разработка карты путешествия клиента CJM</h1>
    <p>
      Поскольку пользовательский интерфейс ориентирован в первую очередь на человека, то при
      проектировании интерфейса необходимо узнать, что хочет получить пользователь. Проектирование
      интерфейса начинают с понимания пользовательской задачи. Это поможет создать полезное решение,
      без лишних функций.
    </p>

    <p>
      Пользователи (Клиенты) — основной источник прибыли компании, поэтому необходимо понимать их
      потребности. Customer Journey Map разрабатывается на основании исследований и аналитики,
      поэтому позволяет лучше изучить аудиторию. А затем спрогнозировать все шаги в пользовательском
      сценарии, максимально приблизив их к реальному процессу покупки, и минимизировать барьеры на
      этом пути. Customer journey map ― это карта взаимодействия пользователя с продуктом и брендом,
      которая основывается на анализе интересов, потребностей и поведения целевой аудитории (ЦА).
    </p>

    <p>
      Целевая аудитория ― потенциальные потребители продукта. Именно их по-английски и называют
      customers. Это те люди, которые заинтересованы в продукте, так как он решает их проблему.
      Вариантов построения карт ― большое количество. Для каждого бизнеса будет своя индивидуальная
      подборка целевой аудитории и ее пути знакомства с продуктом.
    </p>

    <p>
      Карту составляют для понимания психологии потребительского поведения (страхи, мотивы, ожидания
      клиентов), для анализа текущего опыта пользователя, для фиксации точек контакта пользователя с
      продуктом, для выяснения, что происходит с покупателем на каждом шаге его пути, для
      проектирования пользовательского опыта с помощью USM.
    </p>

    <p>
      CJM рассматривается как весь путь клиента, но есть другой вариант карты, созданный для
      отслеживания пути пользователя на сайте ― user journey. В данном случае обращается внимание на
      реакцию пользователя на сайт или приложение. User journey, он же ― путь пользователя при
      взаимодействии с сайтом или приложением. Карта показывает пользовательский опыт,
      пользовательский опыт ― это действия, чувства, страхи и мысли клиента. При составлении карты
      также указываются варианты решения на каждом этапе: как проработать проблемные места и как
      усилить моменты радости у целевой аудитории.
    </p>

    <p>
      Ключевой задачей при составлении user journey — сбор фактических данных о поведении
      пользователей на сайте. Эти данные помогут оптимизировать страницы сайта с учетом потребностей
      ваших пользователей. Маршрут пользователя не линеен, имеет массу ответвлений от точки входа на
      сайт до заказа, поэтому и CJM отражает нелинейное движение клиента. Важно не потерять клиента
      на каждом этапе пути.
    </p>

    <p>
      Нелинейное движение клиента ― это хаотичное движение, которое совершает клиент: выбор
      продукта, оценка мотивации, принятие решения, откладывание покупки, отказ или возврат к
      необходимости купить продукт. Причины у каждого клиента свои, но главное в CJM ― найти общую
      проблему и предложить вариант решения. Нет возможности купить продукт сейчас ― предложите
      скидку или рассрочку.
    </p>

    <p>
      Один из самых важных пунктов при создании CJM - cоздание профиля пользователя (покупателя).
      Персонаж — не реальный человек, а вымышленный образ. Но этот образ основан на данных о ваших
      реальных пользователях. Когда вы разрабатываете сайт или создаете контент-стратегию не
      абстрактно, а для конкретного персонажа, появляется больше ясности о том, каким должен быть
      конечный продукт. Выделите шаблоны поведения пользователей и определите их главные
      характеристики от пола и возраста до места работы и интересов. На основе закономерностей
      соберите несколько портретов покупателей.
    </p>

    <p>
      У каждого покупателя свой путь к продукту, поэтому «карту путешествия» лучше составлять для
      нескольких персонажей. Персонажи разных сегментов аудитории будут по-разному реагировать на
      цены, у них будут разные ожидания и впечатления. Для подробного описания пути необходима
      информация о действиях покупателя — его проблемы, сомнения и поиск вариантов, триггеры и
      отвлекающие факторы. Например, как клиент узнаёт о приложении, с кем сравнивает, почему он
      расстраивается и в какой момент он полностью доволен.
    </p>
  </typo-text>
</template>

<style scoped lang="scss"></style>
