<script lang="ts" setup>
const config = useRuntimeConfig()
useHead({
  script: [
    {
      src: config.public.typoTextSrc,
      tagPosition: 'bodyClose'
    }
  ]
})
</script>

<template>
  <typo-text font-size="15px" text-align="justify" column-count="1" column-width="520px">
    <h1 heading-size="lg" heading-align="center">Рязань</h1>
    <p>
      Рязань – старинный город и областной центр, расположенный в Средней полосе России и входящий в
      тридцатку самых крупных городов страны. Рязань стоит на правом берегу реки Оки и удалена от
      Москвы на 190 км. В этот город приезжает немало российских и иностранных туристов, желающих
      познакомиться с одной из древнейших русских территорий, а также больше узнать о народных
      традициях и самобытных промыслах – скопинской керамике, михайловских кружевах, кадомском
      венизе и изделиях из лозы, которые мастерят в Шиловском районе Рязанской области.
    </p>

    <p>
      Долгое время поселение на Оке называли Переяславлем-Рязанским, а Рязань стояла в стороне от
      него и была столицей крупного удельного княжества. В XIII веке монголы полностью уничтожили
      Рязань, и главным городом Рязанского княжества стал Переяславль-Рязанский. Переименование
      города произошло в 1778 году, во время правления императрицы Екатерины II. Именно тогда
      Переяславль-Рязанский взял имя утраченной столицы, и его стали называть Рязанью.
    </p>

    <p>
      Старинный русский город привлекает путешественников живописной исторической застройкой и
      древними монастырями. Больше всего туристов бывает в музей-заповеднике – Рязанском кремле и
      Свято-Троицкой мужской обители. Приехав сюда на несколько дней, можно посетить местные музеи и
      выставочные залы, съездить на экскурсии по Рязанской области, побывать в есенинских местах и
      приятно провести время в городских парках.
    </p>

    <p>
      Рязань ориентирована на туристов, и в ней построено достаточное количество отелей и гостевых
      домов. Однако, особой популярностью у путешественников пользуются небольшие частные
      мини-гостиницы и дешевые хостелы. Многие туристы предпочитают останавливаться не в самом
      городе, а на базах отдыха, которые находятся в пригородах Рязани.
    </p>

    <p>
      Рязань – город, имеющий долгую историю, поэтому здесь находится много интересных музеев.
      Главным музейным центром считается территория Рязанского кремля. Большой популярностью у
      туристов пользуется художественный музей, который носит имя известного русского гравера Ивана
      Петровича Пожалостина. Музейные коллекции размещены в старинном здании, построенном на рубеже
      XVIII-XIX веков (ул. Свободы, 57). В его залах экспонируются богатые собрания картин, графики,
      скульптур и прикладных работ, выполненных отечественными и западноевропейскими художниками.
      Музей открыт в любой день, кроме понедельника, с 11.00 до 19.00.
    </p>

    <p>
      В самом центре Рязани стоит небольшой уютный особняк, окруженный фруктовым садом. Усадьба
      академика Ивана Петровича Павлова находится на улице, носящей имя знаменитого физиолога (ул.
      Павлова, 25). Здесь в точности сохраняется обстановка павловского дома, личные вещи ученого,
      его книги и рукописи. Музей-усадьба принимает гостей со вторника по пятницу с 9.00 до 18.00, а
      в субботу и воскресенье с 10.00 до 18.00.
    </p>

    <p>
      В городе существует музей путешественников, который рассказывает об экспедициях и спортивных
      походах жителей Рязани (ул. Ленина, 35). Визитной карточкой этого музея стала выставка
      «Русская Америка: От Рязани до Юкона». Музей путешественников открыт с понедельника по четверг
      с 9.00 до 18.00, а в пятницу с 9.00 до 17.00. По субботам и воскресеньям он не работает.
    </p>

    <p>
      В областном центре созданы три музея, посвященные военной тематике. На площади Маргелова, 1,
      открыт музей истории ВДВ, на авиабазе в Дягилево работает музей дальней авиации (ул.
      Белякова), а на улице Военных автомобилистов, 12, гостей принимает музей военной автомобильной
      техники.
    </p>

    <p>
      Не так давно в Рязани создали галерею пряников и выставили в ней пряники и пряничные изделия
      самых разных форм и размеров. В новом музее можно увидеть миниатюрные пряничные домики,
      покрытую белоснежной глазурью пряничную деревню и пряники в виде фигурок животных и цветов.
      Здесь не только рассматривают вкусные кулинарные шедевры, но и дегустируют их. Галерея
      пряников расположена на ул. Свободы, 4, и открыта ежедневно с 10.00 до 19.00.
    </p>
  </typo-text>
</template>

<style scoped lang="scss"></style>
