<script lang="ts" setup>
const config = useRuntimeConfig()
useHead({
  script: [
    {
      src: config.public.typoTextSrc,
      tagPosition: 'bodyClose'
    }
  ]
})
</script>

<template>
  <typo-text
    font-size="15px"
    text-align="left"
    column-count="1"
    column-width="520px"
    line-height="24px"
  >
    <h1 heading-size="lg" heading-align="center">Проектирование композиции интерфейса</h1>
    <p>
      Композиция (лат. «compositio» – соединение, связь) – обеспечивает логичное и гармоничное
      расположение частей, из которых состоит целое, придавая ясность и стройность форме и делая
      доходчивым содержание. Основные принципы композиции: целесообразность, единство и
      соподчиненность, равновесие, наличие смыслового центра, гармония.
    </p>

    <p>
      Основные принципы композиции взаимосвязаны друг с другом и если мы говорим о целесообразности,
      то это определяется обоснованностью формирования композиции при данном контенте, то есть
      определяется целесообразность наличие изображения текста графического материала схем
      инфографики.
    </p>

    <p>
      Композиция должна восприниматься как единое целое, не должно возникать ощущения оторванности
      элементов, самостоятельного существования на странице. Все элементы должны быть взаимосвязаны,
      их наличие должно быть обосновано содержанием. Добиться единства и соподчиненности помогает
      наличие смыслового центра это то, на чем делается визуальные акцент и в свою очередь такой
      визуальный акцент будет также являться и смысловым акцентом (на что в большей степени
      пользователь должен обратить внимание) все остальные элементы композиции должны находиться в
      подчинении такого визуального центра дополнять его помогать понять основной смысл и посыл,
      который закладывает разработчик.
    </p>

    <p>
      Следующе понятие относится в большей степени к особенностям зрительного восприятия, дело в
      том, что существуют определенные законы гармоничного восприятия объекта на плоскости или в
      пространстве. Существует несколько правил которые описывают наиболее визуально привлекательное
      расположение смысловых центров. К таким пропорциональным зависимостям относятся, например,
      золотое сечение правило третей или второе правило третей (Рис.1).
    </p>

    <img
      src="/images/props.png"
      object-fit="cover"
      image-caption="Рисунок 1 — Примеры деления экрана в пропорциональных зависимостях"
    />

    <p>
      Из рисунка видно что мы рассматриваем экран как двумерную плоскость, по вертикали горизонтали
      происходит деление плоскости в соответствии с пропорциональными зависимостями, описанными
      выше. При пересечении вертикальных и горизонтальных линий соответствующих этим
      пропорциональным зависимостям образуется так называемые визуальные центры или центра
      притяжения в них рекомендуется размещать наиболее важные элементы – композиционные центры, или
      на линиях соответствующих пропорциональную зависимость.
    </p>

    <p>
      Так как наблюдается смещение центра при порционах зависимостях относительно оптического центра
      то стоит сказать о таком моменте как равновесие композиции. Равновесие характеризуется тем что
      возникает ощущение стабильной композиции которые не заваливается на какую либо из сторон для
      если говорить о весовых ощущениях, то следует отметить следующие важные моменты: чем крупнее
      объект тем он смотрится более тяжёлым, чем более насыщенный цвет у объекта тем он тоже будет
      смотреться более тяжелым. Также существует ассоциативное восприятие тяжести, например, если мы
      располагаем в композиции объект который очевидно будет тяжелым к примеру гирю, а другой
      стороны мы располагаем что-то воздушное, например, облако то объект который по природе легче
      он будет восприниматься лёгким при прочих равных. Если композиция симметрична, и правая часть
      повторяет левую или верхняя часть повторяет нижнюю или же симметрия идет по диагонали, в этом
      случае автоматически композиционное решение будет считаться уравновешенным.
    </p>

    <img
      src="/images/dices.png"
      alt="Картинка"
      height="150px"
      object-fit="cover"
      object-position="center center"
      image-caption="Рисунок 2 — Примеры передачи движения"
      image-float="left"
      image-float-percent="35"
    />

    <p>
      При формировании композиционных решений существует возможность на двумерной плоскости без
      использования анимации и видео передать эффект движения. Эффект движения может быть передан
      различными способами например размытие объекта, изображение объектов в момент начала движения,
      задание траектории движения, все это позволяет создать эффект динамичности (Рис. 2, Рис. 3).
    </p>

    <img
      src="/images/car.png"
      object-fit="cover"
      image-caption="Рисунок 3 — Примеры передачи движения"
    />

    <p>
      При этом важно учитывать, что важным моментом является направление движения для европейской
      культуры наиболее свойственно воспринимать движение слева направо как движение вперед в связи
      с направлением чтения, соответственно движение справа налево будет восприниматься как движение
      назад то же самое касается и движения сверху вниз и снизу вверх, если мы изображаем движение
      или направление движения сверху вниз то это падение если мы изображаем движение снизу вверх то
      это будет рост.
    </p>
  </typo-text>
</template>

<style scoped lang="scss"></style>
