<script lang="ts" setup>
const config = useRuntimeConfig()
useHead({
  script: [
    {
      src: config.public.typoTextSrc,
      tagPosition: 'bodyClose'
    }
  ]
})
</script>

<template>
  <typo-text font-size="15px" text-align="justify" column-count="1" column-width="520px">
    <h1 heading-size="lg" heading-align="center">Хабаровск</h1>
    <p>
      Хабаровск — один из крупнейших городов Дальнего Востока. Он расположен неподалеку от
      российско-китайской границы, на правобережье реки Амур и назван в честь землепроходца и
      исследователя XVII века Ерофея Хабарова. Хабаровск появился на карте Дальнего Востока в
      середине XIX века и за полтора столетия превратился в крупный индустриальный и культурный
      центр, где сегодня живет более 600 тыс. человек. На российской банкноте в 5000 рублей можно
      увидеть местные достопримечательности – мост, утес и памятник Николаю Николаевичу Муравьеву.
    </p>

    <img src="/images/khabarovsk-most.jpg" object-fit="cover" image-caption="Хабаровский мост" />

    <p>
      Сами жители называют город «Ха» или «Хабара». Внешне он очень напоминает города Поволжья. В
      основном Хабаровск имеет «советскую» и «постсоветскую» застройку. Но по сравнению с другими
      городами региона, здесь сохранилось достаточное количество дореволюционных зданий. Особенно
      много таких домов находится в Центральном и Краснофлотском районах.
    </p>

    <p>
      Расстояние от российской столицы до Хабаровска по воздуху составляет 6100 км, а по железной
      дороге – 8533 км. До ближайшего населенного пункта на территории Китая, поселка Фуюань, от
      Хабаровска всего 65 км. Город построен на землях Среднеамурской низменности, неподалеку от
      устья реки Уссури. Он вытянут вдоль возвышенного берега реки Амур и Амурской протоки на 33 км
      и имеет площадь 383 км².
    </p>

    <p>
      Хабаровск раскинулся в зоне умеренного муссонного климата. На всем Дальнем Востоке
      господствует теплое влажное лето и снежная морозная зима. Средняя температура января держится
      на отметке -20 °С, а июля +21,3 °С. Самая холодная зима здесь была в 2011 году, тогда столбик
      термометра опустился до -41,1 °С. Годом раньше в Хабаровске был зафиксирован абсолютный летний
      максимум +36,7 °С.
    </p>

    <p>
      В дальневосточном городе около трехсот дней в году стоит солнечная погода. По похожим дням он
      в три раза превосходит Москву и Санкт-Петербург. Особенно солнечно бывает в регионе с конца
      осени до начала весны, когда здесь господствует зимний Сибирский антициклон. В течение года
      над городом выпадает 684 мм осадков. Наиболее дождливыми месяцами являются июль и август, а
      зимой, наоборот, устанавливается сухая погода.
    </p>

    <img
      height="200px"
      src="/images/khabarovsk-dendrariy.webp"
      alt="Картинка"
      object-fit="cover"
      object-position="center center"
      image-caption="Хабаровский дендрарий"
      image-float="right"
      image-float-percent="35"
    />

    <p>
      Если визит в Хабаровск пришелся на период с мая по октябрь, стоит заглянуть в местный
      дендрарий, который находится на Волочаевской улице, 71, практически в центре города. Зеленая
      зона появилась здесь в 1896 году. Она началась с экспериментальной лаборатории с питомником и
      полем для лесничества. Прошло время, и территория разрослась до большого ботанического сада
      площадью 12 га. Хабаровский дендрарий – популярная природная достопримечательность и отличное
      место для прогулок. В нем произрастает 386 видов растений, привезенных из разных уголков
      планеты. На аллеях нашлось место для амурского дикого винограда, уссурийской груши, амурского
      бархата, маньчжурского ореха и лимонника китайского. Доехать до дендрария можно на трамваях №
      1, 2 и 6.
    </p>

    <p>
      В Хабаровске стоит побывать в музеях и выставочных залах. Несколько крупных музеев расположены
      в центре города, на улице Шевченко. В летние дни многие хабаровчане и туристы любят проводить
      время на городском пляже, который раскинулся на берегу Амура, рядом с набережной адмирала
      Невельского. Правда, течение в реке довольно сильное, поэтому купающимся не советуют заплывать
      слишком далеко от берега.
    </p>

    <p>
      Отдыхая в Хабаровске, путешественники посещают городские театры, цирк и парки отдыха. В январе
      туристы приезжают на популярный фестиваль «Ледовая Фантазия». Этот праздник собирает любителей
      ледяных скульптур со всей страны и даже из-за рубежа. Для размещения туристов в
      дальневосточном городе открыты гостиницы, мини-отели и гостевые дома. Многие путешественники
      предпочитают арендовать квартиры посуточно или останавливаются в хостелах.
    </p>

    <p>
      Местные кафе и рестораны предлагают гостям традиционную русскую и европейскую кухню. В
      Хабаровске популярны недорогие сети кафе «Золотая Птичка» и «Блин», которые можно найти в
      разных частях города. Близость Китая и Кореи придает хабаровскому общепиту особый колорит.
      Здесь открыто достаточно заведений, где отлично готовят корейские, японские и китайские блюда.
    </p>
  </typo-text>
</template>

<style scoped lang="scss"></style>
